In [5]:
import pandas  as pd

In [7]:
df = pd.read_csv("eda_hypothetical_dataset.csv")

In [8]:
df.head()

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned
0,C1000,56.0,Female,Bangalore,2022-10-04,2023-10-10,C,1,800,800,33119.0,2.0,Desktop,LOYAL,0,1
1,C1001,69.0,Female,Kolkata,2024-01-31,2024-10-13,C,3,800,2400,47764.0,2.0,Desktop,SUMMER,0,1
2,C1002,46.0,Male,Delhi,2023-11-07,2024-05-22,B,30,1200,3600,49900.0,3.0,Desktop,NEWUSER,0,0
3,C1003,32.0,Male,Kolkata,2023-01-29,2023-11-28,C,2,800,1600,30213.0,4.0,Desktop,NEWUSER,0,1
4,C1004,60.0,Female,Mumbai,2023-04-02,2023-04-12,C,2,800,1600,62067.0,4.0,Desktop,NONE,0,0

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         200 non-null    object
 1   Age                 195 non-null    float64
 2   Gender              195 non-null    object
 3   City                200 non-null    object
 4   Signup_Date         200 non-null    object
 5   Last_Purchase_Date  195 non-null    object
 6   Product             200 non-null    object
 7   Units_Sold          200 non-null    int64
 8   Price               200 non-null    object
 9   Total_Amount        200 non-null    int64
 10  Income              195 non-null    float64
 11  Feedback_Score      186 non-null    float64
 12  Device              200 non-null    object
 13  Promo_Code          197 non-null    object
 14  Fraud_Flag          200 non-null    int64
 15  Churned             200 non-null    int64
dtypes: float64(3), int64(4), object(9)
memory usage: 25.1+ KB

In [10]:
df.isnull().sum()

Customer_ID            0
Age                    5
Gender                 5
City                   0
Signup_Date            0
Last_Purchase_Date     5
Product                0
Units_Sold             0
Price                  0
Total_Amount           0
Income                 5
Feedback_Score        14
Device                 0
Promo_Code             3
Fraud_Flag             0
Churned                0
dtype: int64

In [11]:
df.isin(['N/A', 'unknown', '']).sum()

Customer_ID           0
Age                   0
Gender                1
City                  0
Signup_Date           0
Last_Purchase_Date    0
Product               0
Units_Sold            0
Price                 0
Total_Amount          0
Income                0
Feedback_Score        0
Device                0
Promo_Code            0
Fraud_Flag            0
Churned               0
dtype: int64

In [12]:
df.duplicated().sum()

0

In [16]:
df.duplicated(subset=['Customer_ID']).sum()

3

In [17]:
df.dtypes

Customer_ID            object
Age                   float64
Gender                 object
City                   object
Signup_Date            object
Last_Purchase_Date     object
Product                object
Units_Sold              int64
Price                  object
Total_Amount            int64
Income                float64
Feedback_Score        float64
Device                 object
Promo_Code             object
Fraud_Flag              int64
Churned                 int64
dtype: object

In [19]:
df['City'].unique()

array(['Bangalore', 'Kolkata', 'Delhi', 'Mumbai', 'Chennai', 'Bangalore ',
       'delhi', 'DELHI', 'mumbai', 'chennai'], dtype=object)

In [20]:
df['Gender'].unique()

array(['Female', 'Male', nan, 'F', 'unknown', 'male', 'M', 'Female '],
      dtype=object)

In [21]:
df['Promo_Code'].unique()

array(['LOYAL', 'SUMMER', 'NEWUSER', 'NONE', 'WINTER', nan], dtype=object)

In [22]:
df.describe()

,Age,Units_Sold,Total_Amount,Income,Feedback_Score,Fraud_Flag,Churned
count,195.000000,200.000000,200.00000,1.950000e+02,186.000000,200.000000,200.000000
mean,43.815385,2.580000,2461.16500,9.893518e+04,3.096774,0.015000,0.415000
std,16.997476,2.246963,1448.39236,7.128575e+05,1.356183,0.121857,0.493958
min,3.000000,-1.000000,500.00000,-1.000000e+03,1.000000,0.000000,0.000000
25%,31.000000,1.000000,1478.25000,3.726350e+04,2.000000,0.000000,0.000000
50%,44.000000,2.500000,2400.00000,4.827700e+04,3.000000,0.000000,0.000000
75%,56.000000,3.000000,3299.00000,5.894850e+04,4.000000,0.000000,1.000000
max,150.000000,30.000000,6000.00000,9.999999e+06,5.000000,1.000000,1.000000

In [23]:
df[df['Age'] > 100]

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned
77,C1077,150.0,Female,Bangalore,2022-08-18,2023-03-13,B,1,1200,1200,51512.0,3.0,Desktop,WINTER,0,0

In [24]:
df[df['Age'] < 10]

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned
45,C1045,3.0,Male,Mumbai,2023-01-02,2023-03-28,D,2,1500,3000,34201.0,2.0,Desktop,NONE,0,1

In [25]:
df[df['Units_Sold'] < 1]

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned
140,C1140,54.0,Female,Kolkata,2023-11-03,2024-01-03,A,-1,500,1000,56700.0,3.0,Mobile,WINTER,0,0

In [26]:
df[df['Income'] < 0]

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned
92,C1091,64.0,Male,Delhi,2023-10-10,2024-09-09,B,4,1200,4800,-1000.0,3.0,Desktop,LOYAL,0,0

In [27]:
df['Expected_Total'] = df['Units_Sold'] * pd.to_numeric(df['Price'], errors='coerce')
df['Mismatch'] = df['Expected_Total'] != df['Total_Amount']
df[df['Mismatch']]

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned,Expected_Total,Mismatch
2,C1002,46.0,Male,Delhi,2023-11-07,2024-05-22,B,30,1200,3600,49900.0,3.0,Desktop,NEWUSER,0,0,36000.0,True
37,C1037,68.0,Female,Delhi,2022-09-22,2023-09-15,B,3,1200,3545,38410.0,5.0,Desktop,NEWUSER,0,0,3600.0,True
38,C1038,61.0,Female,Bangalore,2023-03-31,2023-12-15,C,3,800,3217,48662.0,5.0,Desktop,SUMMER,0,0,2400.0,True
60,C1060,25.0,Male,Kolkata,2022-02-11,2022-07-15,A,1,500,1413,69736.0,NaN,Desktop,WINTER,0,1,500.0,True
69,C1069,19.0,Male,Mumbai,2022-08-23,2023-04-16,B,2,Rs 1200,2400,49536.0,NaN,Mobile,NONE,0,1,NaN,True
70,C1070,23.0,Male,Delhi,2023-10-20,2024-11-12,C,2,800,1309,44964.0,3.0,Desktop,NONE,0,0,1600.0,True
81,C1081,48.0,Female,Kolkata,2022-06-17,2022-08-22,A,1,500,597,60764.0,3.0,Mobile,SUMMER,0,0,500.0,True
94,C1094,43.0,Male,Delhi,2022-12-31,2023-11-04,D,2,1500,2952,28485.0,4.0,Desktop,SUMMER,0,1,3000.0,True
100,C1100,62.0,Female,Delhi,2022-08-05,2022-11-19,A,4,Rs 500,2000,58610.0,3.0,Desktop,NONE,0,0,NaN,True
116,C1116,50.0,Female,Kolkata,2022-06-22,NaN,B,2,Rs 1200,2400,79625.0,2.0,Desktop,SUMMER,0,1,NaN,True
133,C1133,61.0,Male,Delhi,2023-01-04,2023-10-12,B,4,Rs 1200,4800,65933.0,4.0,Mobile,LOYAL,0,0,NaN,True
140,C1140,54.0,Female,Kolkata,2023-11-03,2024-01-03,A,-1,500,1000,56700.0,3.0,Mobile,WINTER,0,0,-500.0,True
157,C1157,49.0,Male,Chennai,2023-06-10,2023-08-27,A,1,Rs 500,500,54245.0,4.0,Mobile,NEWUSER,0,0,NaN,True
175,C1175,68.0,Male,Kolkata,2022-05-02,2023-02-18,A,1,Rs 500,500,34236.0,1.0,Desktop,SUMMER,0,0,NaN,True

In [28]:
df['Signup_Date'].head(20)

0     2022-10-04
1     2024-01-31
2     2023-11-07
3     2023-01-29
4     2023-04-02
5     2022-07-11
6     2024-01-09
7     2023-11-20
8     2022-04-09
9     2023-07-02
10    2022-04-06
11    2023-10-26
12    2023-10-25
13    2022-07-09
14    2024-01-06
15    2022-02-06
16    2024-02-19
17    2023-01-04
18    2023-11-26
19    2023-06-09
Name: Signup_Date, dtype: object

In [29]:
df['Signup_Date'].apply(lambda x: type(x)).value_counts()

Signup_Date
<class 'str'>    200
Name: count, dtype: int64